eisup_2019_docmng_integration/src/Documents/абс_ВводЗначенийПоказателейДляРасчетаКПЭ/абс_ВводЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВводЗначенийПоказателейДляРасчетаКПЭ</name>
  <registerRecords>InformationRegister.абс_ЗначенияПоказателейДляРасчетаКПЭ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныйПлан</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗагрузкиКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитикиКПЭ</name>
      <type>
        <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияПоказателейДляРасчетаКПЭ/абс_ЗначенияПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияПоказателейДляРасчетаКПЭ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовВводЗначенийПоказателейДляРасчетаКПЭ/абс_ИзменениеСтатусовВводЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовВводЗначенийПоказателейДляРасчетаКПЭ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВводЗначений</name>
    <type>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыЗагрузкиКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыЗагрузкиКПЭ/абс_СтатусыЗагрузкиКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗагрузкиКПЭ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ВводЗначенийПоказателейДляРасчетаКПЭ/ObjectModule.bsl
Функция ПодготовитьТЧЗначенияПоказателей()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка.ВидОперации КАК ВидОперации,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Период,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка.НомерКорректировки,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка.Организация,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка.Показатель КАК Показатель,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.ЗначениеПоказателя,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.ВидАналитикиКПЭ,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Подразделение,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Должность,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Сотрудник,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка.ВидПремии,
	|	ИСТИНА КАК Активность,
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.абс_ВводЗначенийПоказателейДляРасчетаКПЭ.ЗначенияПоказателей КАК абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей
	|ГДЕ
	|	абс_ВводЗначенийПоказателейДляРасчетаКПЭЗначенияПоказателей.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДвиженияПоРегиструЗначенияПоказателей(ТаблицаДокумента)
	
	Движения.абс_ЗначенияПоказателейДляРасчетаКПЭ.Загрузить(ТаблицаДокумента);
	
	Движения.абс_ЗначенияПоказателейДляРасчетаКПЭ.Записать();
	
КонецПроцедуры

Функция НайтиЗадачуПоВводЗначенийПоказателейДляРасчетаКПЭ(БизнесПроцесс, ТочкаМаршрута, Исполнитель = Неопределено, ОтборПоИсполнителю = Истина)
	
	ОтборПоИсполнителю = Ложь;
	МассивЗадач = Новый Массив;
	
	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ
	                           |	абсЗадачаДоговора.Ссылка
	                           |ИЗ
	                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                           |ГДЕ
	                           |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
	                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
	                           |
	                           |УПОРЯДОЧИТЬ ПО
	                           |	абсЗадачаДоговора.Дата УБЫВ");
							   
							   
	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс"		, БизнесПроцесс);
	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута"		, ТочкаМаршрута);
	ЗапросЗадач.УстановитьПараметр("Исполнитель"		, Исполнитель);
	ЗапросЗадач.УстановитьПараметр("ОтборПоИсполнителю"	, ОтборПоИсполнителю);
	
	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
	
	ЗадачаСсылка = Неопределено;
	
	Если ВыборкаЗадач.Следующий() Тогда
		МассивЗадач.Добавить(ВыборкаЗадач.Ссылка);
	КонецЕсли;
	
	Возврат МассивЗадач;
	
КонецФункции

Функция ПолучитьЗадачуПоВводЗначенийПоказателейДляРасчетаКПЭ()
	
	БП = НайтиБПСогласование();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СпТочек = Новый Массив;
	ТекСтатус = Ссылка.Статус;
	
	Если ТекСтатус = Перечисления.абс_СтатусыЗагрузкиКПЭ.Подготовка Тогда
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеЗначенийПоказателейДляРасчетаКПЭ.ТочкиМаршрута.Отказ);	
	ИначеЕсли  ТекСтатус = Перечисления.абс_СтатусыЗагрузкиКПЭ.Отказ Тогда	
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеЗначенийПоказателейДляРасчетаКПЭ.ТочкиМаршрута.Подготовка);
	КонецЕсли;	
	
	Возврат НайтиЗадачуПоВводЗначенийПоказателейДляРасчетаКПЭ(БП, СпТочек,,Ложь);
	
КонецФункции

Функция НайтиБПСогласование() Экспорт
	
	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоВводЗначенийПоказателейДляРасчетаКПЭ(Ссылка);
	
КонецФункции

Процедура ВыполнитьЗадачуСогласование(ЗадачаСогласование)
	
	Если НЕ ЗадачаСогласование.Выполнена Тогда
		ЗадачаОбъект = ЗадачаСогласование.ПолучитьОбъект();		
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусВводЗначенийПоказателейДляРасчетаКПЭ(Ссылка);
	
	Если Статус = Перечисления.абс_СтатусыЗагрузкиКПЭ.Подготовка Тогда
		БизнесПроцессЗапущен = Ложь;
		// Запустим БП если он еще не запущен
		БПСогласование = НайтиБПСогласование();
		
		Если Не ЗначениеЗаполнено(БПСогласование) Тогда
			абс_БизнесПроцессы.ЗапуститьБПСогласованияВводЗначенийПоказателейДляРасчетаКПЭ(Ссылка);
		Иначе
			БизнесПроцессЗапущен = Истина;
		КонецЕсли;	
	Иначе
		БизнесПроцессЗапущен = Истина;
	КонецЕсли;	
	
	//Закрытие задач
//	Если НЕ Статус = СтатусПоРегистру ИЛИ НЕ ЗначениеЗаполнено(СтатусПоРегистру) Тогда
		Если БизнесПроцессЗапущен Тогда
			// Попробуем закрыть задачу согласования
			ЗадачаСогласование = ПолучитьЗадачуПоВводЗначенийПоказателейДляРасчетаКПЭ();
			
			Если НЕ ЗадачаСогласование = Неопределено Тогда
				Для Каждого Стр Из ЗадачаСогласование Цикл
					ВыполнитьЗадачуСогласование(Стр);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
//	КонецЕсли;

	
	Если НЕ Статус = Перечисления.абс_СтатусыЗагрузкиКПЭ.Согласован Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗначенияПоказателей = ПодготовитьТЧЗначенияПоказателей();
	ДвиженияПоРегиструЗначенияПоказателей(ТаблицаЗначенияПоказателей);
	
КонецПроцедуры

Процедура ЗаписатьНовыйСтатус(НовыйСтатус,ПричинаИзмененияСтатуса)

	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовВводЗначенийПоказателейДляРасчетаКПЭ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВводЗначений.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.ВводЗначений			= Ссылка;
	Запись.Пользователь	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.СтатусДокумента  	= НовыйСтатус;
	
	Запись.Комментарий 			= ПричинаИзмененияСтатуса;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусВводЗначенийПоказателейДляРасчетаКПЭ(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру Тогда
		ЗаписатьНовыйСтатус(Статус, ПричинаИзмененияСтатуса);		
	КонецЕсли;
	
КонецПроцедуры
